RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Src/stm32h7rsxx_hal_gfxtim.c
/** @addtogroup STM32H7RSxx_HAL_Driver
  * @{
  */
#ifdef HAL_GFXTIM_MODULE_ENABLED
#if defined(GFXTIM)
/** @defgroup GFXTIM GFXTIM
  * @brief GFXTIM HAL module driver
  * @{
  */

/* Exported functions ---------------------------------------------------------*/
/** @defgroup GFXTIM_Exported_Functions  GFXTIM Exported Functions
  * @{
  */

/** @defgroup GFXTIM_Exported_Functions_Group1  Initialization and de-initialization functions
  * @brief    Initialization and de-initialization functions
  *
@verbatim
  ==============================================================================
            ##### Initialization and de-initialization functions #####
  ==============================================================================
    [..]  This section provides functions allowing to :
      (+) Initialize the GFXTIM instance.
      (+) De-initialize the GFXTIM instance.
      (+) Register and unregister callbacks.
@endverbatim
  * @{
  */

/**
  * @brief  Initialize the GFXTIM instance according to the specified parameters
  *         in the GFXTIM_InitTypeDef structure and initialize the associated handle.
  * @param  hgfxtim GFXTIM handle.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_GFXTIM_Init(GFXTIM_HandleTypeDef *hgfxtim)
{
  HAL_StatusTypeDef status = HAL_ERROR;

  if (hgfxtim != NULL)
  {
    /* Check parameters */
    assert_param(IS_GFXTIM_ALL_INSTANCE(hgfxtim->Instance));
    assert_param(IS_GFXTIM_SYNC_SRC(hgfxtim->Init.SynchroSrc));
    assert_param(IS_GFXTIM_TE_SRC(hgfxtim->Init.TearingEffectSrc));
    assert_param(IS_GFXTIM_TE_POLARITY(hgfxtim->Init.TearingEffectPolarity));
    assert_param(IS_GFXTIM_INTERRUPT(hgfxtim->Init.TearingEffectInterrupt));

    if (hgfxtim->State == HAL_GFXTIM_STATE_RESET)
    {
#if (USE_HAL_GFXTIM_REGISTER_CALLBACKS == 1)
      /* Reset callback pointers to the weak predefined callbacks */
      hgfxtim->HAL_GFXTIM_AbsoluteTimer_AFCC1Callback = HAL_GFXTIM_AbsoluteTimer_AFCC1Callback;
      hgfxtim->HAL_GFXTIM_AbsoluteTimer_AFCOFCallback = HAL_GFXTIM_AbsoluteTimer_AFCOFCallback;
      hgfxtim->HAL_GFXTIM_AbsoluteTimer_ALCC1Callback = HAL_GFXTIM_AbsoluteTimer_ALCC1Callback;
      hgfxtim->HAL_GFXTIM_AbsoluteTimer_ALCC2Callback = HAL_GFXTIM_AbsoluteTimer_ALCC2Callback;
      hgfxtim->HAL_GFXTIM_AbsoluteTimer_ALCOFCallback = HAL_GFXTIM_AbsoluteTimer_ALCOFCallback;
      hgfxtim->HAL_GFXTIM_RelativeTimer_RFC1RCallback = HAL_GFXTIM_RelativeTimer_RFC1RCallback;
      hgfxtim->HAL_GFXTIM_RelativeTimer_RFC2RCallback = HAL_GFXTIM_RelativeTimer_RFC2RCallback;
      hgfxtim->HAL_GFXTIM_TECallback = HAL_GFXTIM_TECallback;
      hgfxtim->HAL_GFXTIM_EventGenerator_EV1Callback = HAL_GFXTIM_EventGenerator_EV1Callback;
      hgfxtim->HAL_GFXTIM_EventGenerator_EV2Callback = HAL_GFXTIM_EventGenerator_EV2Callback;
      hgfxtim->HAL_GFXTIM_EventGenerator_EV3Callback = HAL_GFXTIM_EventGenerator_EV3Callback;
      hgfxtim->HAL_GFXTIM_EventGenerator_EV4Callback = HAL_GFXTIM_EventGenerator_EV4Callback;
      hgfxtim->HAL_GFXTIM_WatchdogTimer_AlarmCallback = HAL_GFXTIM_WatchdogTimer_AlarmCallback;
      hgfxtim->HAL_GFXTIM_WatchdogTimer_PreAlarmCallback = HAL_GFXTIM_WatchdogTimer_PreAlarmCallback;
      hgfxtim->ErrorCallback = HAL_GFXTIM_ErrorCallback;

      /* Call GFXTIM MSP init function */
      if (hgfxtim->MspInitCallback == NULL)
      {
        hgfxtim->MspInitCallback = HAL_GFXTIM_MspInit;
      }
      hgfxtim->MspInitCallback(hgfxtim);
#else /* USE_HAL_GFXTIM_REGISTER_CALLBACKS */
      /* Call GFXTIM MSP init function */
      HAL_GFXTIM_MspInit(hgfxtim);
#endif /* USE_HAL_GFXTIM_REGISTER_CALLBACKS */

      /* Set Synchronization signals sources (HSYNC and VSYNC), Tearing Effect source and polarity,  */
      MODIFY_REG(hgfxtim->Instance->CR, \
                 GFXTIM_CR_SYNCS | GFXTIM_CR_TES | GFXTIM_CR_TEPOL,
                 hgfxtim->Init.SynchroSrc | hgfxtim->Init.TearingEffectSrc | hgfxtim->Init.TearingEffectPolarity);

      /* Set tearing effect interrupt */
      MODIFY_REG(hgfxtim->Instance->IER, GFXTIM_IER_TEIE,
                 (hgfxtim->Init.TearingEffectInterrupt << GFXTIM_IER_TEIE_Pos));

      /* Update error code and state */
      hgfxtim->ErrorCode = GFXTIM_ERROR_NONE;
      hgfxtim->State = HAL_GFXTIM_STATE_READY;
      status = HAL_OK;
    }
  }

  return status;
}

/**
  * @brief  De-initialize the GFXTIM instance.
  * @param  hgfxtim GFXTIM handle.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_GFXTIM_DeInit(GFXTIM_HandleTypeDef *hgfxtim)
{
  HAL_StatusTypeDef status = HAL_ERROR;

  if (hgfxtim != NULL)
  {
    /* Check parameters */
    assert_param(IS_GFXTIM_ALL_INSTANCE(hgfxtim->Instance));

    if (hgfxtim->State == HAL_GFXTIM_STATE_READY)
    {
      /* Call GFXTIM MSP deinit function */
#if (USE_HAL_GFXTIM_REGISTER_CALLBACKS == 1)
      if (hgfxtim->MspDeInitCallback == NULL)
      {
        hgfxtim->MspDeInitCallback = HAL_GFXTIM_MspDeInit;
      }
      hgfxtim->MspDeInitCallback(hgfxtim);
#else /* USE_HAL_GFXTIM_REGISTER_CALLBACKS */
      HAL_GFXTIM_MspDeInit(hgfxtim);
#endif /* USE_HAL_GFXTIM_REGISTER_CALLBACKS */

      /* Update state */
      hgfxtim->State = HAL_GFXTIM_STATE_RESET;
      status = HAL_OK;
    }
  }

  return status;
}

/**
  * @brief  Initialize the GFXTIM instance MSP.
  * @param  hgfxtim GFXTIM handle.
  * @retval None.
  */
__weak void HAL_GFXTIM_MspInit(GFXTIM_HandleTypeDef *hgfxtim)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hgfxtim);

  /* NOTE : This function should not be modified, when the function is needed,
            the HAL_GFXTIM_MspInit could be implemented in the user file */
}

/**
  * @brief  De-initialize the GFXTIM instance MSP.
  * @param  hgfxtim GFXTIM handle.
  * @retval None.
  */
__weak void HAL_GFXTIM_MspDeInit(GFXTIM_HandleTypeDef *hgfxtim)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hgfxtim);

  /* NOTE : This function should not be modified, when the function is needed,
            the HAL_GFXTIM_MspDeInit could be implemented in the user file */
}

#if (USE_HAL_GFXTIM_REGISTER_CALLBACKS == 1)
/**
  * @brief  Register a user GFXTIM callback to be used instead of the weak predefined callback.
  * @param  hgfxtim GFXTIM handle.
  * @param  CallbackID ID of the callback to be registered.
  *         This parameter can be one of the following values:
  *           @arg @ref HAL_GFXTIM_AFC_COMPARE1_CB_ID   Absolute frame counter compare 1 callback ID
  *           @arg @ref HAL_GFXTIM_AFC_OVERFLOW_CB_ID   Absolute frame counter overflow callback ID
  *           @arg @ref HAL_GFXTIM_ALC_COMPARE1_CB_ID   Absolute line counter compare 1 callback ID
  *           @arg @ref HAL_GFXTIM_ALC_COMPARE2_CB_ID   Absolute line counter compare 2 callback ID
  *           @arg @ref HAL_GFXTIM_ALC_OVERFLOW_CB_ID   Absolute line counter overflow callback ID
  *           @arg @ref HAL_GFXTIM_RFC1_RELOAD_CB_ID    Relative frame counter 1 reload callback ID
  *           @arg @ref HAL_GFXTIM_RFC2_RELOAD_CB_ID    Relative frame counter 2 reload callback ID
  *           @arg @ref HAL_GFXTIM_TE_CB_ID             External tearing effect callback ID
  *           @arg @ref HAL_GFXTIM_EVENT1_CB_ID         Event events 1 callback ID
  *           @arg @ref HAL_GFXTIM_EVENT2_CB_ID         Event events 2 callback ID
  *           @arg @ref HAL_GFXTIM_EVENT3_CB_ID         Event events 3 callback ID
  *           @arg @ref HAL_GFXTIM_EVENT4_CB_ID         Event events 4 callback ID
  *           @arg @ref HAL_GFXTIM_WDG_ALARM_CB_ID      Watchdog alarm callback ID
  *           @arg @ref HAL_GFXTIM_WDG_PREALARM_CB_ID   Watchdog pre alarm callback ID
  *           @arg @ref HAL_GFXTIM_ERROR_CB_ID          error callback ID
  *           @arg @ref HAL_GFXTIM_MSP_INIT_CB_ID       MSP initialization user callback ID
  *           @arg @ref HAL_GFXTIM_MSP_DEINIT_CB_ID     MSP de-initialization user callback ID
  * @param  pCallback pointer to the callback function.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_GFXTIM_RegisterCallback(GFXTIM_HandleTypeDef *hgfxtim,
                                              HAL_GFXTIM_CallbackIDTypeDef CallbackID,
                                              pGFXTIM_CallbackTypeDef pCallback)
{
  HAL_StatusTypeDef status = HAL_OK;

