RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Src/stm32h7rsxx_hal_gfxtim.c
    if (hgfxtim->State == HAL_GFXTIM_STATE_READY)
    {

      /* Set AFC compare 1 value */
      MODIFY_REG(hgfxtim->Instance->AFCC1R, GFXTIM_AFCC1R_FRAME,
                 (pAbsoluteTimerConfig->FrameCompare1Value << GFXTIM_AFCC1R_FRAME_Pos));

      /* Set AFC counter value */
      MODIFY_REG(hgfxtim->Instance->AFCR, GFXTIM_AFCR_FRAME,
                 (pAbsoluteTimerConfig->FrameCounterValue << GFXTIM_AFCR_FRAME_Pos));

      /* Set ALC compare 1 value */
      MODIFY_REG(hgfxtim->Instance->ALCC1R, GFXTIM_ALCC1R_LINE,
                 (pAbsoluteTimerConfig->LineCompare1Value << GFXTIM_ALCC1R_LINE_Pos));

      /* Set ALC compare 2 value */
      MODIFY_REG(hgfxtim->Instance->ALCC2R, GFXTIM_ALCC2R_LINE,
                 (pAbsoluteTimerConfig->LineCompare2Value << GFXTIM_ALCC2R_LINE_Pos));

      /* Set ALC counter value */
      MODIFY_REG(hgfxtim->Instance->ALCR, GFXTIM_ALCR_LINE,
                 (pAbsoluteTimerConfig->LineCounterValue << GFXTIM_ALCR_LINE_Pos));

      /* Set ALC compare 1, compare 2, overflow interrupts, AFC compare 1 and overflow interrupts */
      MODIFY_REG(hgfxtim->Instance->IER,
                 GFXTIM_IER_ALCC1IE | GFXTIM_IER_ALCC2IE | GFXTIM_IER_ALCOIE | GFXTIM_IER_AFCC1IE | GFXTIM_IER_AFCOIE,
                 (pAbsoluteTimerConfig->FrameOverflowInterrupt << GFXTIM_IER_AFCOIE_Pos) |
                 (pAbsoluteTimerConfig->FrameCompare1Interrupt << GFXTIM_IER_AFCC1IE_Pos) |
                 (pAbsoluteTimerConfig->LineOverflowInterrupt << GFXTIM_IER_ALCOIE_Pos) |
                 (pAbsoluteTimerConfig->LineCompare1Interrupt << GFXTIM_IER_ALCC1IE_Pos) |
                 (pAbsoluteTimerConfig->LineCompare2Interrupt << GFXTIM_IER_ALCC2IE_Pos));
    }
    else
    {
      status = HAL_ERROR;
    }
  }

  /* Return function status */
  return status;
}

/**
  * @brief  This function starts absolute timer.
  * @param  hgfxtim GFXTIM handle.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_GFXTIM_AbsoluteTimer_Start(GFXTIM_HandleTypeDef *hgfxtim)
{
  HAL_StatusTypeDef status = HAL_OK;

  if (hgfxtim == NULL)
  {
    status = HAL_ERROR;
  }
  else
  {
    /* Check parameters */
    assert_param(IS_GFXTIM_ALL_INSTANCE(hgfxtim->Instance));

    if (hgfxtim->State == HAL_GFXTIM_STATE_READY)
    {
      /* Enable absolute Timer */
      SET_BIT(hgfxtim->Instance->TCR, (GFXTIM_TCR_AFCEN | GFXTIM_TCR_ALCEN));
    }
    else
    {
      status = HAL_ERROR;
    }
  }

  /* Return function status */
  return status;
}

/**
  * @brief  This function stops absolute timer counter(s).
  * @param  hgfxtim GFXTIM handle.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_GFXTIM_AbsoluteTimer_Stop(GFXTIM_HandleTypeDef *hgfxtim)
{
  HAL_StatusTypeDef status = HAL_OK;

  if (hgfxtim == NULL)
  {
    status = HAL_ERROR;
  }
  else
  {
    /* Check parameters */
    assert_param(IS_GFXTIM_ALL_INSTANCE(hgfxtim->Instance));

    if (hgfxtim->State == HAL_GFXTIM_STATE_READY)
    {
      /* Disable absolute counter(s) */
      SET_BIT(hgfxtim->Instance->TDR, (GFXTIM_TDR_ALCDIS | GFXTIM_TDR_AFCDIS));
    }
    else
    {
      status = HAL_ERROR;
    }
  }

  /* Return function status */
  return status;
}

/**
  * @brief  This function resets absolute timer counters.
  * @param  hgfxtim GFXTIM handle.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_GFXTIM_AbsoluteTimer_Reset(GFXTIM_HandleTypeDef *hgfxtim)
{
  HAL_StatusTypeDef status = HAL_OK;

  if (hgfxtim == NULL)
  {
    status = HAL_ERROR;
  }
  else
  {
    /* Check parameters */
    assert_param(IS_GFXTIM_ALL_INSTANCE(hgfxtim->Instance));

    if (hgfxtim->State == HAL_GFXTIM_STATE_READY)
    {
      /* Disable absolute counter(s) */
      SET_BIT(hgfxtim->Instance->TCR, (GFXTIM_TCR_FAFCR | GFXTIM_TCR_FALCR));
    }
    else
    {
      status = HAL_ERROR;
    }
  }

  /* Return function status */
  return status;
}

/**
  * @brief  This function gets absolute timer value.
  * @param  hgfxtim GFXTIM handle.
  * @param  AbsoluteTime absolute time
  *         This parameter can be a value of @ref GFXTIM_AbsoluteTime.
  * @param  pValue Absolute time value
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_GFXTIM_AbsoluteTimer_GetCounter(const GFXTIM_HandleTypeDef *hgfxtim, uint32_t AbsoluteTime,
                                                      uint32_t *pValue)
{
  HAL_StatusTypeDef status = HAL_OK;

  if ((hgfxtim == NULL) || (pValue == NULL))
  {
    status = HAL_ERROR;
  }
  else
  {
    /* Check parameters */
    assert_param(IS_GFXTIM_ALL_INSTANCE(hgfxtim->Instance));
    assert_param(IS_GFXTIM_ABSOLUTE_TIME(AbsoluteTime));

    if (hgfxtim->State == HAL_GFXTIM_STATE_READY)
    {
      switch (AbsoluteTime)
      {
        case GFXTIM_ABSOLUTE_GLOBAL_TIME:
          *pValue = READ_REG(hgfxtim->Instance->ATR);
          break;
        case GFXTIM_ABSOLUTE_FRAME_TIME:
          *pValue = READ_REG(hgfxtim->Instance->AFCR);
          break;
        default:
          /* GFXTIM_ABSOLUTE_LINE_TIME */
          *pValue = READ_REG(hgfxtim->Instance->ALCR);
          break;
      }
    }
    else
    {
      status = HAL_ERROR;
    }
  }
  return status;
}

/**
  * @brief  This function sets absolute frame compare value.
  * @param  hgfxtim GFXTIM handle.
  * @param  Value Absolute frame compare 1 value
  *         This parameter can be a number between Min_Data = 0x00000 and Max_Data = 0xFFFFF
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_GFXTIM_AbsoluteTimer_SetFrameCompare(GFXTIM_HandleTypeDef *hgfxtim, uint32_t Value)
{
  HAL_StatusTypeDef status = HAL_OK;

  if (hgfxtim == NULL)
  {
    status = HAL_ERROR;
  }
  else
  {
    /* Check parameters */
    assert_param(IS_GFXTIM_ALL_INSTANCE(hgfxtim->Instance));

    if (hgfxtim->State == HAL_GFXTIM_STATE_READY)
    {
      /* Set absolute frame counter compare 1 register value */
      MODIFY_REG(hgfxtim->Instance->AFCC1R, GFXTIM_AFCC1R_FRAME,
                 (Value << GFXTIM_AFCC1R_FRAME_Pos));
    }
    else
    {
      status = HAL_ERROR;
    }
  }

  return status;
}

/**
  * @brief  This function sets line compare value.
  * @param  hgfxtim GFXTIM handle.
  * @param  AbsoluteLineComparator Absolute line compare value
  *         This parameter can be a value of @ref GFXTIM_AbsoluteLineComparator.
  * @param  Value Absolute line compare value
  *         This parameter can be a number between Min_Data = 0x000 and Max_Data = 0xFFF
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_GFXTIM_AbsoluteTimer_SetLineCompare(GFXTIM_HandleTypeDef *hgfxtim,
                                                          uint32_t AbsoluteLineComparator, uint32_t Value)
{
  HAL_StatusTypeDef status = HAL_OK;

